In [9]:
# let us import the Pandas Library
import pandas as pd

#Define a dictionary 'x'
a = {'name': ['kemal','supun','dhanush','nipun'],
           'ID': [18,45,65,78],
           'Dep': ['SD','YD','ED','YD'],
           'Salary': ['100k','50k','20k','50k']}

#casting the dictionary to a DataFrame
df = pd.DataFrame(a)

In [10]:
#display the result df
df

      name  ID Dep Salary
0    kemal  18  SD   100k
1    supun  45  YD    50k
2  dhanush  65  ED    20k
3    nipun  78  YD    50k

In [18]:
#Retrieving the "ID" column and assigning it to a variable x
b = df[['ID']]
#print Data
b

   ID
0  18
1  45
2  65
3  78

In [19]:
#Cheack type of a
type(b)

pandas.core.frame.DataFrame

In [20]:
c = df[['name','Dep','Salary']]
c

      name Dep Salary
0    kemal  SD   100k
1    supun  YD    50k
2  dhanush  ED    20k
3    nipun  YD    50k

In [21]:
students = {'Student':['David', 'Samuel', 'Terry', 'Evan'],
             'Age':['27', '24', '22', '32'],
             'Country':['UK', 'Canada', 'China', 'USA'],
             'Course':['Python','Data Structures','Machine Learning','Web Development'],
             'Marks':['85','72','89','76']}

df = pd.DataFrame(students)

df

  Student Age Country            Course Marks
0   David  27      UK            Python    85
1  Samuel  24  Canada   Data Structures    72
2   Terry  22   China  Machine Learning    89
3    Evan  32     USA   Web Development    76

In [23]:
d = df[['Student','Age','Country']]
d

  Student Age Country
0   David  27      UK
1  Samuel  24  Canada
2   Terry  22   China
3    Evan  32     USA

In [29]:
# Access the value on the first row and the first column

df.iloc[0, 0]

'David'

In [30]:
df.iloc[0,4]

'85'

In [32]:
df.iloc[3,0]

'Evan'

In [35]:
df.loc[2,'Marks']

'89'

In [36]:
df2 = df
df2=df2.set_index('Student')

In [37]:
#To display the first 5 rows of new dataframe
df2.head()

        Age Country            Course Marks
Student
David    27      UK            Python    85
Samuel   24  Canada   Data Structures    72
Terry    22   China  Machine Learning    89
Evan     32     USA   Web Development    76

In [40]:
df2.loc['Evan','Course']

'Web Development'

In [42]:
df2.iloc[2,1]

'China'

In [43]:
# let us do the slicing using old dataframe df

df2.iloc[0:2, 0:3]

        Age Country           Course
Student
David    27      UK           Python
Samuel   24  Canada  Data Structures

In [46]:
df.loc[0:3,'Student':'Country']

  Student Age Country
0   David  27      UK
1  Samuel  24  Canada
2   Terry  22   China
3    Evan  32     USA

In [48]:
from pyodide.http import pyfetch

import pandas as pd

filename = "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-PY0101EN-SkillsNetwork/labs/Module%204/data/example1.txt"

async def download(url, filename):

    response = await pyfetch(url)

    if response.status == 200:

        with open(filename, "wb") as f:

            f.write(await response.bytes())

await download(filename, "example1.txt")

print("done")

ModuleNotFoundError: No module named 'pyodide'